driver-tests/bpelse/assign/AssignJbi/test/results/echoBase64BinaryDataType_Invoke/Actual_20130318180028_S.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" 
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
    xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Body>
    <item xmlns="http://stc.com/echoBase64BinaryDataType" xmlns:msgns="http://stc.com/echoBase64BinaryDataType">
      <string>ZQ==</string>
      <normalizedString>ZQ==</normalizedString>
      <token>ZQ==</token>
      <base64Binary>ZQ==</base64Binary>
      <hexBinary>ZQ==</hexBinary>
      <integer>ZQ==</integer>
      <positiveInteger>ZQ==</positiveInteger>
      <negativeInteger>ZQ==</negativeInteger>
      <nonNegativeInteger>ZQ==</nonNegativeInteger>
      <nonPositiveInteger>ZQ==</nonPositiveInteger>
      <long>ZQ==</long>
      <unsignedLong>ZQ==</unsignedLong>
      <int>ZQ==</int>
      <unsignedInt>ZQ==</unsignedInt>
      <short>ZQ==</short>
      <unsignedShort>ZQ==</unsignedShort>
      <byte>ZQ==</byte>
      <unsignedByte>ZQ==</unsignedByte>
      <decimal>ZQ==</decimal>
      <float>ZQ==</float>
      <double>ZQ==</double>
      <boolean>ZQ==</boolean>
      <duration>ZQ==</duration>
      <dateTime>ZQ==</dateTime>
      <date>ZQ==</date>
      <time>ZQ==</time>
      <gYear>ZQ==</gYear>
      <gYearMonth>ZQ==</gYearMonth>
      <gMonth>ZQ==</gMonth>
      <gMonthDay>ZQ==</gMonthDay>
      <gDay>ZQ==</gDay>
      <Name>ZQ==</Name>
      <QName>ZQ==</QName>
      <NCName>ZQ==</NCName>
      <anyURI>ZQ==</anyURI>
      <language>ZQ==</language>
      <ID>ZQ==</ID>
      <IDREF>ZQ==</IDREF>
      <IDREFS>ZQ==</IDREFS>
      <ENTITY>ZQ==</ENTITY>
      <ENTITIES>ZQ==</ENTITIES>
      <NMTOKEN>ZQ==</NMTOKEN>
      <NMTOKENS>ZQ==</NMTOKENS>
    </item>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>